// Кто разработал язык программирования JavaScript?
alert("Самая первая реализация JavaScript была создана Бренданом Эйхом");

// За сколько дней был разработан JavaScript?
alert("10 дней");

// В каком году появился JavaScript?
alert("Анонсирован этот язык был 18 июля 1996 года");

// JavaScript — это то же самое, что и Java? (отвечайте либо «JavaScript — это Java», либо «JavaScript — это не Java»)

alert(
    "Java представляет собой объектно-ориентированный язык программирования, а JavaScript - это объектно-ор иентированный язык создания сценариев",
);

// Как называется спецификация JavaScript?
alert("ECMAScript");
