let response1 = prompt("Сколько будет 2 + 2?");
if (response1 === "4") {
    alert("Ответ: если ты ответил 4, то ты прав.");
} else {
    alert("Ответ неверный. Правильный ответ: 4.");
}

let response2 = prompt("Чему равен корень из 9?");
if (response2 === "3") {
    alert("Ответ: если ты ответил 3, то ты прав.");
} else {
    alert("Ответ неверный. Правильный ответ: 3.");
}

let response3 = prompt("Сколько будет 2 в 5-й степени?");
if (response3 === "32") {
    alert("Ответ: если ты ответил 32, то ты прав.");
} else {
    alert("Ответ неверный. Правильный ответ: 32.");
}
